// 컴파일 타임 & 런타임
// 컴파일 타임: 개발자가 소스코드를 작성할 때 컴퓨터가 이해할 수 있는 언어(기계어)로 변환하는 과정
// 런타임: 컴파일된 코드를 실제 메모리에 적재해서 프로그램을 실행하는 시간
// 타입스크립트는 컴파일 단계에서 실행된다. -> 기계어로 변환하기 전에 타입을 먼저 검사해준다.
// 타입스크립트 컴파일러 -> `tsc`: 타입스크립트(소스코드) -> 자바스크립트(소스코드) ⭕ / 소스코드 -> 기계어 변환 ❌

// 실행 순서
// 1. tsc 컴파일러를 통해 타입스크립트 실행 (ts -> js)
// 2. 소스코드를 토큰화 시켜준다. (토큰: 소스코드를 구성하는 가장 작은 단위)
// 3. 토큰을 가지고 노드 트리를 만든다.
// 4. 각 노드에 대응되는 타입을 만들어줌 (symbol)
// 5. 노드 트리와 symbol을 비교하면서 타입검사
// => 에러 ? 에러 : 자바스크립트 변환  6. 성공 시 자바스크립트로 변환 (tsconfig.json에 나와있는 설정값대로 변환)
// 7. 자바스크립트 파일이 나옴
// 8. 브라우저로 가서 v8 엔진을 통해서 프로그램이 실행이 된다.

//tsconfig.json
{
  "compilerOptions": {
    "target": "es6", // 컴파일된 자바스크립트 버전
    "module": "ESNext", // 모듈 시스템 지정
    "strict": true, // 엄격한 타입체킹
    "esModuleInterop": true, // CommonJS와 ES 모듈 간의 상호 작용
    "skipLibCheck": true, // 외부라이브러리 타입체킹 여부
    "forceConsistentCasingInFileNames": true, //파일 이름의 대소문자 일관성을 강제
    "moduleResolution": "node", // Typescript가 모듈(외부 라이브러리나 프로젝트 내 다른 파일)을 해석하
    "outDir": "./dist", // 컴파일 된 파일들이 저장될 디렉토리를 지정합니다. ⭐
    "sourceMap": true // 소스 맵을 생성하여, 디버깅 시 TypeScript 코드와 매핑되게 합니다.
  },
  "include": ["src/**/*.ts"], // 컴파일 과정에 포함될 파일들의 배열입니다.
  "exclude": ["node_modules", "dist"] // 컴파일 과정에 제외될 파일들의 배열입니다.
}